# Librería Pandas

**18/10/2021**

- Dos clases:
  - Series (1 dimensión)
  - DataFrames (2+ dimensiones)
  
A **pandas series** is a one-dimensional data structure that comprises of a key-value pair. It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data.

A **pandas dataframe** is a two-dimensional data-structure that can be thought of as a spreadsheet. A dataframe can also be thought of as a combination of two or more series.

In [1]:
for i in list(map(chr, range(97, 123))):
    print(i)

a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z

In [4]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

## 1. Series y DataFrames

In [ ]:
countries = pd.Series(['Spain','UK','Italy','Denmark','France']) # sin indice
countries_ind = pd.Series(['Spain','UK','Italy','Denmark','France'],index=range(5,10,1)) # con  indice
countries_ind2 = pd.Series(['Spain','UK','Italy','Denmark','France'],index=['a','b','c','d','e']) # con  indice
print(countries)
print('')
print(countries_ind)
print('')
print(countries_ind2)

In [ ]:
print(countries[2])
print('')
print(countries_ind2['b'])
print('')
print(countries_ind2[['a','b']])

### Masks y funciones de NumPy

In [5]:
# uso de masks para seleccionar
fibonacci = pd.Series([0, 1, 1, 2, 3, 5, 8, 13, 21])
mask = fibonacci > 10
print(mask)
print(fibonacci[mask])

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool
7    13
8    21
dtype: int64

In [ ]:
np.sum(fibonacci)

In [ ]:
# Ejercicio número aúreo. Demostrar que cuando n --> infinito, n+1/n --> número aúreo

def Fibonacci(Number):
    if(Number==0):
        return 0
    elif(Number==1):
        return 1
    else:
        return (Fibonacci(Number-2)+Fibonacci(Number-1))
n = 10
print("Fibonacci Sequence:")
for n in range(0, n):
    if n!= 0:
        aureo = Fibonacci(n + 1)/Fibonacci(n) 
        print(aureo)

### Iterar sobre elementos

In [6]:
for index, value in fibonacci.items():  #.iteritems()
    print('Index: ' + str(index) + '  Value: ' + str(value))

Index: 0  Value: 0
Index: 1  Value: 1
Index: 2  Value: 1
Index: 3  Value: 2
Index: 4  Value: 3
Index: 5  Value: 5
Index: 6  Value: 8
Index: 7  Value: 13
Index: 8  Value: 21

In [7]:
for index, value in fibonacci.iteritems(): 
    print('Index: ' + str(index) + '  Value: ' + str(value))

Index: 0  Value: 0
Index: 1  Value: 1
Index: 2  Value: 1
Index: 3  Value: 2
Index: 4  Value: 3
Index: 5  Value: 5
Index: 6  Value: 8
Index: 7  Value: 13
Index: 8  Value: 21

### Crear series a partir de diccionarios

In [8]:
# crear una serie a partir de un diccionario
mi_serie = pd.Series({'Maria' : 175, 'Juan': 180})
print('Los índices son: ', mi_serie.index)
print('Los valores de la serie son:', mi_serie.values)
print('La serie completa es:\n', mi_serie)

Los índices son:  Index(['Maria', 'Juan'], dtype='object')
Los valores de la serie son: [175 180]
La serie completa es:
 Maria    175
Juan     180
dtype: int64

### Operaciones entre series

In [9]:
serie1 = pd.Series([10,20,30,40],index=range(4) )
serie2 = pd.Series([1,2,3],index=range(3) )
print(serie1 + serie2)
print(serie1 - serie2)

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64
0     9.0
1    18.0
2    27.0
3     NaN
dtype: float64

In [18]:
serie3 = pd.Series([10,20,30,40],index=range(4,8,1) )
print(serie1+serie3)

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
dtype: float64

## Dataframe

Un **DataFrame** es una estructura de datos con dos dimensiones en la cual se puede guardar datos de distintos tipos (como caractéres, enteros, valores de punto flotante, factores y más) en columnas. Es similar a una hoja de cálculo o una tabla de SQL o el data.frame de R. Un DataFrame siempre tiene un índice (con inicio en 0). El índice refiere a la posición de un elemento en la estructura de datos. Pueden ser creados de las formas:

* Con una Serie de pandas
* Lista de diccionarios
* Dicionario de Series de Pandas
* Con un array de Numpy de dos dimensiones
* Con array estructurado de Numpy

In [19]:
diccionario = { "Nombre" : ["Ana","Juan","Pepe"], 
                "Edad" : [34,29,12],
                "Salario": [1000,2000,np.nan]}

# las claves identifican columnas y columns especifica el número y orden de las columnas

frame = pd.DataFrame(diccionario, index = ['a', 'b', 'c'],columns = ['Nacionalidad', 'Nombre', 'Edad', 'Profesion','Salario'])
display(frame)

  Nacionalidad Nombre  Edad Profesion  Salario
a          NaN    Ana    34       NaN   1000.0
b          NaN   Juan    29       NaN   2000.0
c          NaN   Pepe    12       NaN      NaN

In [20]:
frame['Nombre'].replace('Ana', 'Ana Maria', inplace = True)
frame.replace

  Nacionalidad     Nombre  Edad Profesion  Salario
a          NaN  Ana Maria    34       NaN   1000.0
b          NaN       Juan    29       NaN   2000.0
c          NaN       Pepe    12       NaN      NaN

In [21]:
frame.loc[frame.Salario==2000,'Salario'] = 5000
frame.loc

  Nacionalidad     Nombre  Edad Profesion  Salario
a          NaN  Ana Maria    34       NaN   1000.0
b          NaN       Juan    29       NaN   5000.0
c          NaN       Pepe    12       NaN      NaN

In [22]:
frame['Salario'] = frame['Salario'].replace([np.nan],frame['Salario'].mean() )
frame

  Nacionalidad     Nombre  Edad Profesion  Salario
a          NaN  Ana Maria    34       NaN   1000.0
b          NaN       Juan    29       NaN   5000.0
c          NaN       Pepe    12       NaN   3000.0

In [23]:
# Si hay espacios en el nombre de la columna la primera opción no es válida
frame.Nombre, frame["Nombre"]

(a    Ana Maria
 b         Juan
 c         Pepe
 Name: Nombre, dtype: object,
 a    Ana Maria
 b         Juan
 c         Pepe
 Name: Nombre, dtype: object)

### Acceso y modificación de elementos

In [24]:
frame["Nombre"][0]

'Ana Maria'

In [28]:
# añadir columnas
frame = pd.DataFrame(diccionario,columns=['Nacionalidad', 'Nombre', 'Edad', 'Profesion','Salario'])
frame['Direccion'] = 'Desconocida'
display(frame)

  Nacionalidad Nombre  Edad Profesion  Salario    Direccion
0          NaN    Ana    34       NaN   1000.0  Desconocida
1          NaN   Juan    29       NaN   2000.0  Desconocida
2          NaN   Pepe    12       NaN      NaN  Desconocida

In [31]:
# añadir fila (requiere todos los valores)
user_2 = ['España','Pepe',39, 'none', 1200,'Desconocida']
frame.loc[len(frame)] = user_2
display(frame)

  Nacionalidad Nombre  Edad Profesion  Salario    Direccion
0          NaN    Ana    34       NaN   1000.0  Desconocida
1          NaN   Juan    29       NaN   2000.0  Desconocida
2       España   Pepe    39      none   1200.0  Desconocida

In [32]:
# eliminar fila 
frame.drop(2, inplace = True)
display(frame)

  Nacionalidad Nombre  Edad Profesion  Salario    Direccion
0          NaN    Ana    34       NaN   1000.0  Desconocida
1          NaN   Juan    29       NaN   2000.0  Desconocida

In [33]:
#eliminar columna
del frame['Profesion']
display(frame)

  Nacionalidad Nombre  Edad  Salario    Direccion
0          NaN    Ana    34   1000.0  Desconocida
1          NaN   Juan    29   2000.0  Desconocida

### Filtros

La principal diferencia entre loc e iloc es:
- **loc** es label-based --> hay que especificar filas y columnas basándote en las etiquetas.
 - loc[row_label, column_label]
- **iloc** es integer position-based --> hay que especificar filas y columnas  mediante los valores de posición
 - iloc[row_position, column_position]

In [ ]:
from IPython.display import Image
Image(filename='images/loc.png')

In [41]:
# Acceso a un valor concreto por indice posicional [row, col]
print(df_data.iloc[3, 1])

# Slicing
display(df_data.iloc[:3,:4])

10

      ciudad  temperatura   o2
a   Valencia           10  1.0
b  Barcelona            8  NaN
c   Valencia            9  NaN

In [36]:
d1 = {'ciudad':'Valencia', 'temperatura':10, 'o2':1}
d2 = {'ciudad':'Barcelona', 'temperatura':8}
d3 = {'ciudad':'Valencia', 'temperatura':9}
d4 = {'ciudad':'Madrid', 'temperatura':10, 'humedad':80}
d5 = {'ciudad':'Sevilla', 'temperatura':15, 'humedad':50, 'co2':6}
d6 = {'ciudad':'Valencia', 'temperatura':10, 'humedad':90, 'co2':10}
ls_data = [d1, d2, d3, d4, d5, d6]  # lista de diccionarios
df_data = pd.DataFrame(ls_data, index = list('abcdef'))
display(df_data)

      ciudad  temperatura   o2  humedad   co2
a   Valencia           10  1.0      NaN   NaN
b  Barcelona            8  NaN      NaN   NaN
c   Valencia            9  NaN      NaN   NaN
d     Madrid           10  NaN     80.0   NaN
e    Sevilla           15  NaN     50.0   6.0
f   Valencia           10  NaN     90.0  10.0

In [ ]:
display(df_data.loc['d', 'temperatura'])
display(df_data.loc[:'c', :'o2'])
display(df_data.loc[:'c', 'temperatura':'o2'])

display(df_data.loc[:, ['ciudad','o2']])

In [ ]:
# Ejercicio. Obtener:
#    Valores de Valencia
print(df_data.loc[df_data.ciudad == 'Valencia'])
#    Valores donde temperatura es 10
print(df_data.loc[df_data.temperatura == 10])
#    Valores donde temperatura es menor que 10
 print(df_data.loc[df_data.temperatura < 10])
#    Valores donde humedad es menor que 70 y mayor que 90
print(df_data.loc[(df_data.humedad < 70) & (df_data.humedad > 90)])
#    Valores donde la ciudad es Sevilla o Madrid
print(df_data.loc[df_data.ciudad == 'Sevilla' | df_data.ciudad == 'Madrid'])
#    Valores donde c02 es nulo
print(df_data[df_data['co2'].isnull()])

#    Reemplazar los nulos de humedad con la media
df_data['humedad'] = df_data['humedad'].replace([np.nan],df_data['humedad'].mean() )
print(df_data)

### Iteracción, Indexación y Slicing

In [35]:
for a in frame:
    print(a) 
    print(type(a))
    
print('')

for value in frame.values:
    print(value)
    print(type(value))

Nacionalidad
<class 'str'>
Nombre
<class 'str'>
Edad
<class 'str'>
Salario
<class 'str'>
Direccion
<class 'str'>

[nan 'Ana' 34 1000.0 'Desconocida']
<class 'numpy.ndarray'>
[nan 'Juan' 29 2000.0 'Desconocida']
<class 'numpy.ndarray'>

### Cargar y guardar datos con pandas

In [ ]:
# GCargar datos
import os
ruta = os.path.join("datasets", "titanic.csv")
fichero = open(ruta)
data = pd.read_csv(ruta)
fichero.close()
data.head()

In [ ]:
# Guardar a csv
import os
ruta = os.path.join("datasets" ,"my_titanic.csv")
data.to_csv(ruta, sep=';') # sep por defecto: ','

### Operaciones de manejo de datos

In [ ]:
from IPython.display import Image
Image(filename='images/joins.jpg')

**Uniendo datasets con 'join' y 'merge'**
- merge() == join()
 - 'join' utiliza por defecto los índices para unir
- Utilizando el parámetro 'on'
 - Si las columnas difieren, 'left_on' y 'right_on'

In [103]:
empleados1 = pd.DataFrame([["Maria",2,3,4],["Mario",6,7,8],["Juan",10,11,12],["Pepe",14,15,16]], columns=["Name","B","C", "D"])

empleados2 = pd.DataFrame([["Maria",2,3],["Luis",6,7],["Juana",10,11],["Pepe",15,16]], columns=["Name","F","G"])

In [104]:
display(empleados1)
print("----------------------")
display(empleados2)

    Name   B   C   D
0  Maria   2   3   4
1  Mario   6   7   8
2   Juan  10  11  12
3   Pepe  14  15  16

----------------------

    Name   F   G
0  Maria   2   3
1   Luis   6   7
2  Juana  10  11
3   Pepe  15  16

**MERGE**

In [105]:
merged_data = empleados1.merge(empleados2, on='Name', how='inner') # parametro 'on' define la columna pivote
merged_data, merged_data.shape

(    Name   B   C   D   F   G
 0  Maria   2   3   4   2   3
 1   Pepe  14  15  16  15  16,
 (2, 6))

In [106]:
merged_data = empleados1.merge(empleados2, on='Name', how='left') # parametro 'on' define la columna pivote
merged_data, merged_data.shape

(    Name   B   C   D     F     G
 0  Maria   2   3   4   2.0   3.0
 1  Mario   6   7   8   NaN   NaN
 2   Juan  10  11  12   NaN   NaN
 3   Pepe  14  15  16  15.0  16.0,
 (4, 6))

In [107]:
merged_data = empleados1.merge(empleados2, on='Name', how='right') # parametro 'on' define la columna pivote
merged_data, merged_data.shape

(    Name     B     C     D   F   G
 0  Maria   2.0   3.0   4.0   2   3
 1   Luis   NaN   NaN   NaN   6   7
 2  Juana   NaN   NaN   NaN  10  11
 3   Pepe  14.0  15.0  16.0  15  16,
 (4, 6))

In [108]:
merged_data = empleados1.merge(empleados2, on='Name', how='outer') # parametro 'on' define la columna pivote
merged_data, merged_data.shape

(    Name     B     C     D     F     G
 0  Maria   2.0   3.0   4.0   2.0   3.0
 1  Mario   6.0   7.0   8.0   NaN   NaN
 2   Juan  10.0  11.0  12.0   NaN   NaN
 3   Pepe  14.0  15.0  16.0  15.0  16.0
 4   Luis   NaN   NaN   NaN   6.0   7.0
 5  Juana   NaN   NaN   NaN  10.0  11.0,
 (6, 6))

**JOIN**

In [109]:
joined_data = empleados1.join(empleados2.set_index("Name"), how='left')
print(joined_data)

    Name   B   C   D   F   G
0  Maria   2   3   4 NaN NaN
1  Mario   6   7   8 NaN NaN
2   Juan  10  11  12 NaN NaN
3   Pepe  14  15  16 NaN NaN

In [110]:
joined_data = empleados1.join(empleados2.set_index("Name"), how='right')
print(joined_data)

      Name   B   C   D   F   G
Name
Maria  NaN NaN NaN NaN   2   3
Luis   NaN NaN NaN NaN   6   7
Juana  NaN NaN NaN NaN  10  11
Pepe   NaN NaN NaN NaN  15  16

- The **join** method works best when we are joining dataframes on their indexes 
  (though you can specify another column to join on for the left dataframe).
- The **merge** method is more versatile and allows us to specify columns besides the index to join on for both dataframes. 
  If the index gets reset to a counter post merge, we can use set_index to change it back.

**CONCAT**

In [111]:
pd.concat([empleados1,empleados2],axis=0)

    Name     B     C     D     F     G
0  Maria   2.0   3.0   4.0   NaN   NaN
1  Mario   6.0   7.0   8.0   NaN   NaN
2   Juan  10.0  11.0  12.0   NaN   NaN
3   Pepe  14.0  15.0  16.0   NaN   NaN
0  Maria   NaN   NaN   NaN   2.0   3.0
1   Luis   NaN   NaN   NaN   6.0   7.0
2  Juana   NaN   NaN   NaN  10.0  11.0
3   Pepe   NaN   NaN   NaN  15.0  16.0

In [112]:
pd.concat([empleados1,empleados2],axis=1)

    Name   B   C   D   Name   F   G
0  Maria   2   3   4  Maria   2   3
1  Mario   6   7   8   Luis   6   7
2   Juan  10  11  12  Juana  10  11
3   Pepe  14  15  16   Pepe  15  16

## 2. Operaciones con pandas

### Búsqueda de valores y conteo de ocurrencias

In [ ]:
# Buscar valores concretos
display(empleados1.isin(['Maria',11]))

In [ ]:
# Contar  número de ocurrencias
print(empleados1.isin([11]).values.sum())
display(empleados1.isin([15])) #devuelve una mask con valores true si el elemento está

In [ ]:
mask = empleados1.D >= 8
print(mask.values.sum())
display(mask)

In [ ]:
type(empleados1.isin(['Maria']).values)

### Ordenación

In [ ]:
# ordenar por índice
display(empleados1.sort_index(ascending=False))

In [ ]:
#ordenar por columna
display(empleados1.sort_index(axis=1, ascending=True))

In [ ]:
# ordenar filas por valor en columna
display(empleados1.sort_values(by='B', ascending=False))

In [ ]:
# ordenar filas por valor en columna y guardar
empleados1.sort_values(by='C', ascending=True, inplace=True)
display(empleados1)

| Tipo | Operación | Descripción |
|:---------|:-----|:-----|
| Unario | *abs* | Valor absoluto de cada elemento |
| | *sqrt* | Raíz cuadrada de cada elemento |
| | *exp* | e^x, siendo x cad elemento |
| | *log, log10, log2* | Logaritmos en distintas bases de cada elemento |
| | *sign* | Retorna el signo de cada elemento (-1 para negativo, 0 o 1 para positivo) |
| | *ceil* | Redondea cada elemento por arriba |
| | *floor* | Redondea cada elemento por abajo |
| | *isnan* | Retorna si cada elemento es Nan |
| | *cos, sin, tan* | Operaciones trigonométricas en cada elemento |
| | *arccos, arcsin, arctan* | Inversas de operaciones trigonométricas en cada elemento |
| Binario | *add* | Suma de dos arrays |
| | *substract* | Resta de dos arrays |
| | *multiply* | Multiplicación de dos arrays |
| | *divide* | División de dos arrays |
| | *maximum, minimum* | Retorna el valor máximo/mínimo de cada pareja de elementos |
| | *equal, not_equal* | Retorna la comparación (igual o no igual) de cada pareja de elementos |
| | *greater, greater_equal, less, less_equal* | Retorna la comparación (>, >=, <, <= respectivamente) de cada pareja de elementos |

### Aplicación de funciones con lambda

In [ ]:
rand_matrix = np.random.randint(10, size=(3, 4))
frame = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(frame)
print(frame.apply(lambda x : x.max() - x.min())) # diferencia por columna

In [ ]:
# diferencia entre min y max por fila (no columna)
rand_matrix = np.random.randint(10, size=(3, 4))
frame = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(frame)
print(frame.apply(lambda x : x.max() - x.min(), axis = 1)) # diferencia por fila

### Conocer mejor los datos

In [ ]:
data.head()

In [ ]:
data.describe()

In [ ]:
data.describe(include='all')

In [ ]:
data.sex.unique()

In [ ]:
data.sex.value_counts()

In [ ]:
data.fare.mean()

In [ ]:
data.mean()['fare'], data.sum()['fare']

In [ ]:
data.groupby('pclass').mean()['fare']

### Agregaciones más complejas

In [ ]:
# funciones de agregación de varias columnas para obtener distintos estadísticos
display(data.groupby('sex')[['age', 'pclass']].aggregate(['min', np.median, max]))

In [ ]:
# Filtrado de los datos en el que el conjunto no supera una media determinada 
def media(x):
    return x["age"].mean() > 30

data.groupby('sex').filter(media)

# Ejercicios

In [ ]:
# Utilizar el dataset de Fuel Efficiency

In [ ]:
path = 'http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data'

mpg_data = pd.read_csv(path, delim_whitespace=True, header=None,
            names = ['mpg', 'cilindros', 'desplazamiento','potencia',
            'peso', 'aceleracion', 'año', 'origen', 'nombre'],
            na_values='?')

In [ ]:
# Hacer un análisis general de los datos
# Obtener los modelos con peso mayor que 1000
# Obtener los modelos de coche del 77
# Obtener la media de desplazamiento por año
# Obtener la desviación estándar de la aceleración
# Obtener los modelos con 4 o más cilindros, que pesén más de 3500 kg y aceleración inferior a 18